Revit 2026 API

# BoundaryConditionsType Enumeration

---

This enum declares type of BoundaryConditions.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum BoundaryConditionsType
```
```vb
Public Enumeration BoundaryConditionsType
```
```cpp
public enum class BoundaryConditionsType
```
```fsharp
type BoundaryConditionsType
```

| Member name | Value | Description |
| --- | --- | --- |
| Area | 2 | Area Boundary Conditions |
| Line | 1 | Line Boundary Conditions |
| Point | 0 | Point Boundary Conditions |

#### Reference

Autodesk.Revit.DB.Structure Namespace